app/controllers/api/v1/career_paths_controller.rb

SELECT "career_paths".* FROM "career_paths"
---
  def index
    @career_paths = CareerPath.all