backend/app/controllers/api/v1/career_paths_controller.rb

  def index
    career_paths = CareerPath.all
---
SELECT "career_paths".* FROM "career_paths"

  def show
    career_path = CareerPath.find(params[:id])
---
SELECT "career_paths".* FROM "career_paths" WHERE "career_paths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]