backend/app/controllers/api/v1/courses_controller.rb

SELECT "courses".* FROM "courses" INNER JOIN "career_path_courses" ON "courses"."id" = "career_path_courses"."course_id" WHERE "career_path_courses"."career_path_id" = ?  [["career_path_id", 1]]
SELECT "career_paths".* FROM "career_paths" WHERE "career_paths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses"
---
  def index
    if params[:career_path_id]
      courses = CareerPath.find(params[:career_path_id]).courses
    else
      courses = Course.all

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    course = Course.find(params[:id])

SELECT "career_paths".* FROM "career_paths" WHERE "career_paths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "career_path_courses" ("career_path_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["career_path_id", 1], ["course_id", 40], ["created_at", "2020-01-26 06:55:33.839673"], ["updated_at", "2020-01-26 06:55:33.839673"]]
INSERT INTO "courses" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    #if params[:career_path_id]
      career_path = CareerPath.find(params[:career_path_id])
      course = career_path.courses.create(course_params)